README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org836660e)
2.  [Resumo e/ou informação extra:](#org04bc2d3)
3.  [Versão:](#org630f4d1)
4.  [Data:](#orgb43428a)
5.  [Autor de Contato:](#org9c19e85)
6.  [Lista dos Autores:](#org7ed07a1)
7.  [Áreas de pesquisa vinculadas:](#orgdbfdcb7)
8.  [Vinculo com:](#org1118769)
9.  [Paradigmas:](#orgb8c076c)
10. [Tipo de Interface:](#org8235864)
11. [Plataformas Suportadas:](#org94d1f63)
12. [Linguagens Utilizadas:](#org4b6ac09)
13. [Bibliotecas Utilizadas (dependências):](#org5ded747)
14. [Softwares utilizados (dependências)](#org68ee8b4)
15. [Tipo de Licença:](#orgfbfdb42)
16. [Links:](#org9a99faf)


<a id="org836660e"></a>

# Nome do Software (ou Biblioteca):

-   AVALIAÇÃO DAS CONDIÇÕES EXPERIMENTAIS PARA SEPARAÇÃO DE COMPONENTES DO PETRÓLEO POR CROMATOGRAFIA LÍQUIDA UTILIZANDO PLANEJAMENTO FATORIAL


<a id="org04bc2d3"></a>

# Resumo e/ou informação extra:

-   Determinar, a partir do planejamento fatorial com ponto central, as melhores

condições experimentais para a obtenção da fração de hidrocarbonetos satura-
dos do petróleo utilizando a técnica de cromatograa em fase líquida clássica
em coluna aberta, visando diminuir a quantidade de solvente e adsorvente
utilizado, aumentar a porcentagem de recuperação da fração e, como conse-
quência, reduzir a quantidade de resíduos líquidos e sólidos gerados ao meio
ambiente.


<a id="org630f4d1"></a>

# Versão:

-   1.0.


<a id="orgb43428a"></a>

# Data:

-   2019/1 - segundo semestre.


<a id="org9c19e85"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org7ed07a1"></a>

# Lista dos Autores:

-   JHONNY COSTA CARVALHO
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgdbfdcb7"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Geoquímica
-   Planejamento Experimental


<a id="org1118769"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgb8c076c"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org8235864"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org94d1f63"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org4b6ac09"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org5ded747"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org68ee8b4"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orgfbfdb42"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org9a99faf"></a>

# Links:

